app/controllers/sessions_controller.rb

  def create
    if @user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'yo' LIMIT 1