app/controllers/welcome_controller.rb

  def index
    @genres = Genre.all
    @top_movies = Movie.order(aggregate_score: :desc).limit(5)
    @top_reviews = Review.order(points: :desc).limit(5)
---
SELECT  "movies".* FROM "movies"   ORDER BY "movies"."aggregate_score" DESC LIMIT 5
SELECT  "reviews".* FROM "reviews"   ORDER BY "reviews"."points" DESC LIMIT 5