app/controllers/welcome_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "movies".* FROM "movies"   ORDER BY "movies"."id" ASC LIMIT 1
SELECT  "reviews".* FROM "reviews"   ORDER BY "reviews"."id" ASC LIMIT 1
---
  def index
    @genres = Genre.all
    @top_movies = Movie.all
    @reviews = Review.all